InformationRegisters/УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодпадаетПодЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации/Ext/ManagerModule.bsl
Процедура ОформитьСтрокиСписка(Элемент, ОформленияСтрок, мДатаНачалаРеформыСоцСтрахования) Экспорт

	Для каждого ОформлениеСтроки Из ОформленияСтрок Цикл
		
		ДанныеСтроки = ОформлениеСтроки.ДанныеСтроки;
		
		ОформлениеСтроки.Ячейки.ПодпадаетПодЕНВД.ТолькоПросмотр = НЕ ЗначениеЗаполнено(ДанныеСтроки.СпособОтраженияВБухучете);
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.СпособОтраженияВБухучете) Тогда
			ОформлениеСтроки.Ячейки.СпособОтраженияВБухучете.Текст = "<как задано для предприятия в целом>";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеСтроки.Период) и ДанныеСтроки.Период < мДатаНачалаРеформыСоцСтрахования Тогда
			Если Не ЗначениеЗаполнено(ДанныеСтроки.СпособОтраженияВБухучете) Тогда
				ОформлениеСтроки.Ячейки.СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя.Текст = "<как задано для предприятия в целом>";
			КонецЕсли;
			ОформлениеСтроки.Ячейки.СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя.ТолькоПросмотр = Ложь;
		Иначе
			ОформлениеСтроки.Ячейки.СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя.Текст = "<не используется с 2011 года>";
			ОформлениеСтроки.Ячейки.СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя.ТолькоПросмотр = Истина;
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры
